
## Plan Result

[CI link](https://github.com/enokawa/terraform-sandbox/actions/runs/4760347472)


<pre><code>Plan: 3 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.vpc.aws_subnet.private_1
  * module.vpc.aws_subnet.private_2
  * module.vpc.aws_subnet.protected_2


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.vpc.aws_subnet.private_1 will be created
  + resource "aws_subnet" "private_1" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.128.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "dev-sandbox-private-1"
        }
      + tags_all                                       = {
          + "CreatedBy"   = "Terraform"
          + "Environment" = "dev"
          + "Name"        = "dev-sandbox-private-1"
          + "ProjectName" = "sandbox"
        }
      + vpc_id                                         = "vpc-04aede4e87135b698"
    }

  # module.vpc.aws_subnet.private_2 will be created
  + resource "aws_subnet" "private_2" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.144.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "dev-sandbox-private-2"
        }
      + tags_all                                       = {
          + "CreatedBy"   = "Terraform"
          + "Environment" = "dev"
          + "Name"        = "dev-sandbox-private-2"
          + "ProjectName" = "sandbox"
        }
      + vpc_id                                         = "vpc-04aede4e87135b698"
    }

  # module.vpc.aws_subnet.protected_2 will be created
  + resource "aws_subnet" "protected_2" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.80.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "dev-sandbox-protected-2"
        }
      + tags_all                                       = {
          + "CreatedBy"   = "Terraform"
          + "Environment" = "dev"
          + "Name"        = "dev-sandbox-protected-2"
          + "ProjectName" = "sandbox"
        }
      + vpc_id                                         = "vpc-04aede4e87135b698"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform-plan","PRNumber":7,"Program":"tfcmt","SHA1":"a87d38649bc560e60e497e8c49149c03dc9eb4c8","Vars":{},"WorkflowName":"Terraform Plan (develop)"} -->